---
kind: method
id: M:Autodesk.Revit.DB.XYZ.IsUnitLength
zh: 点
source: html/83fd26c0-15dc-ac21-a2af-9567438b0605.htm
---
# Autodesk.Revit.DB.XYZ.IsUnitLength Method

**中文**: 点

The boolean value that indicates whether this vector is of unit length.

## Syntax (C#)
```csharp
public bool IsUnitLength()
```

## Remarks
A unit length vector has a length of one, and is considered normalized.